# 1)შექმენით ფუნქცია,გადაეცით პარამეტრად name ცვლადი,რომელიც იქნება სახელებით სავსე სია და  შენი სახელის გარდა იქნება რამოდენიმე სახელი მოთავსებული,შენი დავალებაა ჩაამატო ამ სიაში შენი სახელი მესამე ინდექსზე
def name(listt):
    listt.insert(2,"nika")
    return listt
print(name(["goga","nuca","giorgi","salome"]))

# 2)შექმენით ფუნქცია,პარამეტრად გაეაეცით name ცვლადი რომელშიც შენაახული  იქნება სტრინგი,შენი დავალებაა დააურბონო ეს სტრინგი შემოტრიალებული

def name(nika):
    return nika[::-1]
print(name("nika"))