# 2) დააყენეთ vscode ში incredible in your face შექმენით 30 აზრიანი ერორი და გვერდით კომენტარის სახით მას მიუწერეთ სწორი ფორმა და ახსნა რატომ არის ასე სწორი და რატომ იყო შეცდომა, თუსურვილი გექნებათ და გაინტერესებს incredible in your face ექსთენშენის შემდეგი სახე ადით დაახლოებით 1500 ერორზე და მას იხილავთ

print nika # <-- ფრჩხილები და პრჭყალები არ აქვს ნაწერს ამიტომაც ერორია რადგან str-ს ჭირდება ბრჭყალები და print-ს ფრჩხილები
print(nika) # <-- აქაც იგივე არის მაგრამ აქ მარტო პრჭყალები აკლია
name nika # <-- ცვლადს მნიშვნელობა არასწორად აქვს მიღებული ჩვენ ტოლაბა გვჭირდება რათა ცვლადს რაღაცის მნიშვნელობა მივცეთ ასევე str-ია და პრჭყალები აკლია
num 12 # <-- აქ იგივეა მაგრამ რადგანაც int-ია არ სჭირდება პრჭყალები
