# 1) შექმენით ერთი სია რომელშიც შეიტანთ სახელებს შემდეგ შექმენით მეორე სია რომელშიც იქნება ისევ სხვადასხვა სახელები გააერთიანეთ ეს ორი 
# სია ჩაამატეთ 5 ინდექსზე ახალი სახელი დაითვალეთ გაერთიანებული სიის სიგრძე და დაითვალეთ თქვენი სახელი რამდენჯერ გვხვდება ამ სიაში, 
# ასევე დაბეჭდეთ რომელ ინდექსზე დგას თქვენი სახელი


list1 = ["ნიკოლოზი", "ლუკა", "გიორგი", "მარი", "თეკლა"]
list2 = ["გაბრიელი", "დათო", "ანნა", "სოფო", "ელენე"]

merged_list = list1 + list2

merged_list.insert(5, "გუგა")

list_length = len(merged_list)

name_count = merged_list.count("ნიკოლოზი")

if "ნიკოლოზი" in merged_list:
    name_index = merged_list.index("ნიკოლოზი")
else:
    name_index = "სია არ შეიცავს 'ნიკოლოზი'-ს"

print("გაერთიანებული სია:", merged_list)
print("სიის სიგრძე:", list_length)
print("სახელი 'ნიკოლოზი' გვხვდება:", name_count, "ჯერ")
print("'ნიკოლოზი' დგას ინდექსზე:", name_index)
